{
"sessions" : [
  {
    "track": "Business",
    "date": "8/7/2019",
    "time_start": "11:00:00",
    "time_end": "12:00:00",
    "location": "Osceola C",
    "code": "BUS09",
    "name": "Why a Workplace Innovation Platform?",
    "description": "What’s so special about a Workplace Innovation Platform? You've seen the videos, you've read all the marketing material, but practically speaking what is that makes a Workplace Innovation Platform standout from other options? We are going to look at the current state of business and work group innovation, and learn through a series of examples and mini case studies why FileMaker, as the leading Workplace Innovation Platform, can be so effective in driving business innovation.",
    "background": "You should have general understanding the FileMaker Platform.",
    "objective_1": "What problems a Workplace Innovation Platform solves",
    "objective_2": "How exactly it enables innovation",
    "objective_3": "Why other types of platforms fall short",
    "objective_4": "That there is very little you can't do with a Workplace Innovation Platform",
    "speaker": "Todd Geist (Geist Interactive)"
  },
  {
    "track": "Business",
    "date": "8/8/2019",
    "time_start": "11:45:00",
    "time_end": "12:00:00",
    "location": "Osceola 4 - 6",
    "code": "BUS19",
    "name": "Getting It Done: The Tools of the Trade for App Dev Team Leaders — Lightning Talk",
    "description": "The more technical the FileMaker Platform becomes, the more there is a need for leaders who can coordinate among specialists in coding, design & integration, all the while speaking the language of the customer clearly and succinctly. Leaders who master this are priceless in tech. They are much rarer than good coders.\u000bThere are plenty of tools and apps that promise to do \"P.M.\". But first and last, project management is about people, and good communication. This session shares the secrets of the great project managers on the FileMaker Platform.",
    "background": "Attendees will find the session meaningful if they've struggled with an app dev team, as member or customer.",
    "objective_1": "When great project management apps can't fix bad team dynamics",
    "objective_2": "Who likes Kanban and who might just as well stay clear of it",
    "objective_3": "How upgrading your project management apps never gives the benefit of adopting the FIRST P.M. app.",
    "objective_4": "Some thoughts on Slack and other \"improvements\" on email communication",
    "speaker": "Gianna Harum-Alvarez (SmallCo.)"
  },
  {
    "track": "Business",
    "date": "8/6/2019",
    "time_start": "14:00:00",
    "time_end": "14:30:00",
    "location": "Osceola 4 - 6",
    "code": "BUS03",
    "name": "FileMaker in Action — 5 Steps to Bring a Legacy App Up to Speed",
    "description": "Business was thriving using a custom tailored FileMaker application developed bit by bit over the past 20 years, but could it improve even more by modernizing our technology? In this session, I will share the 5 steps used to migrate my legacy application to current FileMaker in 2018. Changing horse in the middle of the stream is hard. When it was done, I was happy to retire my tired legacy application and ride off with a new shiny one. Business jumped 20%.",
    "background": "",
    "objective_1": "How to migrate legacy applications to current FileMaker technology",
    "objective_2": "The details on the 5 steps involved for success",
    "objective_3": "What type of results we saw by making the move",
    "objective_4": "",
    "speaker": "Roger Benedict (Ruggs Benedict)"
  },
  {
    "track": "Business",
    "date": "8/6/2019",
    "time_start": "14:45:00",
    "time_end": "15:15:00",
    "location": "Osceola 1 - 3",
    "code": "BUS04",
    "name": "FileMaker in Action — Custom Apps for Manufacturing and Warehouses",
    "description": "In this session, we'll cover topics that relate well to the manufacturing/warehouse space. First, two approaches to inventory; one easy-to-implement solution with unstored calcs, and a more complex solution using static fields with scripted amount updates. Next, we'll go over the creation of labels for the warehouse and how we've used automation to save a LOT of time, including taking a 60 or 90 minute process per shipment down to 30 to 60 seconds. Optionally, as time permits in the session, we will cover some of the practicalities of using FileMaker in a warehouse space.",
    "background": "Attendees should have a basic understanding of one to many relationships, calculation fields, and global fields.",
    "objective_1": "An easy approach to inventory using calculation fields",
    "objective_2": "A more complex approach to inventory using script updates to static fields",
    "objective_3": "Label creation within FileMaker to save a lot of time (looping is key)",
    "objective_4": "Practicalities of FileMaker in a warehouse space",
    "speaker": "Bradley Boggs (Chameleon Like, Inc.)"
  },
  {
    "track": "Create",
    "date": "8/7/2019",
    "time_start": "11:00:00",
    "time_end": "12:00:00",
    "location": "Osceola B",
    "code": "CRE06",
    "name": "Detective Boot Camp: Debugging Best Practices",
    "description": "Debugging is like being a detective in a crime movie... where you are also the murderer\" - Filipe Fortes\u000bIn this session, we will explore how to set up your scripts for debugging success. We will take a deep dive into how to debug using FileMaker's Script Debugger and Data Viewer. Finally, we will explore some common \"crimes\" and how to expose the culprit in each scenario. These examples will explore different concepts to enhance your debugging arsenal. After attending this session, you will have sharpened your detective skills, and hopefully dwindled your destructive tendencies.",
    "background": "Attendees should understand how to construct a script and how to create and use variables.",
    "objective_1": "Set your trap! Setting up your scripts for debugging success",
    "objective_2": "Maximizing native FileMaker Platform tools for debugging",
    "objective_3": "Evaluate common crimes, such as issues with PSOS and ExecuteSQL, and how to solve them",
    "objective_4": "What to do when you've exhausted your arsenal? Call for backup!",
    "speaker": "Makah Encarnacao (Soliant Consulting)"
  },
  {
    "track": "Create",
    "date": "8/8/2019",
    "time_start": "13:30:00",
    "time_end": "14:30:00",
    "location": "Osceola A",
    "code": "CRE16",
    "name": "True Code: Quality Development",
    "description": "The FileMaker Platform gives us a powerful toolset to fit many users' needs: flexible interfaces, multi-platform, robust back-end, and the FileMaker Data API. However for the user, the only non-negotiable aspects are how the solution fits with the business logic and how the user is required to fulfill it. Our mission is putting that solution into the users' hands. To deliver that, at the start of a development project, the users' workflow needs are defined by a number of techniques; the test use cases flow directly from these. This is the criteria for measuring the project's success. This is quality development.",
    "background": "Experience gathering requirements, knowledge of FileMaker Pro Advanced and FileMaker Server features and technical requirements, and experience deploying custom apps on FileMaker Server.",
    "objective_1": "Use case comes first: User experience design flows from the users' roles and business logic",
    "objective_2": "Establishing criteria: Determining how a solution will meet expectations is planned in advance of coding",
    "objective_3": "Neutral technology: Technical considerations conform to workflow and business logic",
    "objective_4": "Measuring success: Testing users' satisfaction is the means to deploy successfully",
    "speaker": "Beatrice Beaubien (i2eye)"
  },
  {
    "track": "Create",
    "date": "8/7/2019",
    "time_start": "14:45:00",
    "time_end": "15:45:00",
    "location": "Osceola B",
    "code": "CRE10",
    "name": "From Clutter to Clarity: Redesigning Layouts for Improved User Experience",
    "description": "Are your interfaces easy to interpret and intuitive to use, or are they so complex that they require explanation and special training? In this session, I'll take a series of cluttered real-world legacy layouts and show in time-lapse fashion how I would redesign them for an improved user experience. I’ll discuss design principles and patterns. I’ll also demonstrate FileMaker-specific skills such as working with styles and themes. I'll also show the same layouts as re-envisioned by several other designers within the FileMaker Community.",
    "background": "You should be comfortable creating and modifying layouts.",
    "objective_1": "Concrete examples of design principles and patterns",
    "objective_2": "Working with styles and themes",
    "objective_3": "Indicating interactivity in clear and consistent ways",
    "objective_4": "Customizing icons",
    "speaker": "Mark Baum (Soliant Consulting)"
  },
  {
    "track": "Create",
    "date": "8/7/2019",
    "time_start": "16:15:00",
    "time_end": "17:15:00",
    "location": "Osceola D",
    "code": "CRE12",
    "name": "Intent-Driven Design: Storytelling Through Visual Narratives",
    "description": "Have you heard about storytelling in UX and how it improves usability and engagement? User intent is a starting point of a successful dialogue, and clear communication doesn't always have to be verbal. It must be concise and accessible. In this session, we will elaborate on the essence of good design: simplicity and familiarity. You will learn how to take these simple principles to demonstrate examples of visual narratives that reflect users' intent. We will be visiting a variety of user scenarios, visual elements, and interface building blocks, and learn how to sequence them to create workflows with a clear purpose and a sense of progress.",
    "background": "No prerequisites.",
    "objective_1": "How to improve usability and engagement through visual storytelling",
    "objective_2": "What makes up good design",
    "objective_3": "How to take simple principles to demonstrate examples of visual narratives that reflect users intent",
    "objective_4": "How to create sequences and workflows to demonstrate purpose and a sense of progress",
    "speaker": "Chih Hsiao, Esther Kim"
  },
  {
    "track": "FBA",
    "date": "8/6/2019",
    "time_start": "11:00:00",
    "time_end": "12:00:00",
    "location": "Osceola 1 - 3",
    "code": "FBA01",
    "name": "Winning in the Area of Hiring and Team Building",
    "description": "In the competitive hunt for top talent, it is often difficult to find, hire, and retain great contractors and employees. In this session, you will get an insider look from a recruiting expert. Learn from his successes and failures in hiring and growing his own team, and hear real life stories about other companies' fumbles in talent acquisition. Building a great team with great people starts with your company culture and an excellent hiring and on-boarding process.\u000bIf you have a desire to grow your team and win with people this is a must attend session for both you and your management team!",
    "background": "You have an interest or need to hire contractors or full-time employees now or in the near future and need help. If you have recently made a new hire this is a great session for you as well.",
    "objective_1": "The do's and don'ts in the search for great talent",
    "objective_2": "How to prepare you and your team for a smooth and successful hiring process",
    "objective_3": "The \"who,\" \"how,\" and \"why\" of hiring",
    "objective_4": "Building a culture of longevity and employee buy-in",
    "speaker": "Brandon Hayes (Kalos Consulting Inc.)"
  },
  {
    "track": "FBA",
    "date": "8/7/2019",
    "time_start": "11:00:00",
    "time_end": "12:00:00",
    "location": "Osceola 1 - 3",
    "code": "FBA03",
    "name": "FBA Partner Council Panel Discussion (FBA Members Only)",
    "description": "The FBA Partner Council (FPC) is a collaboration between FileMaker and a global representation of 9 FBA partners. The purpose of the FPC is to:\u000bShare ideas and plans for mutual growth\u000bFoster collaboration to ensure a thriving FileMaker ecosystem \u000bImprove communication between FileMaker and FBA community\u000bDuring this facilitated session, we will break out into small groups to invite open discussion with session attendees to discuss and consolidate ideas",
    "background": "Current FBA membership is required to attend this session.",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "FBA",
    "date": "8/7/2019",
    "time_start": "14:45:00",
    "time_end": "15:45:00",
    "location": "Osceola 1 - 3",
    "code": "FBA04",
    "name": "DIY Digital Marketing",
    "description": "Gartner Research predicted that by 2017 CMOs would spend more than CIOs on technology. We're well past that transition and see increasing responsibility for marketers. Today, it's all about customer experience; the lines are totally blurred between new and existing customers. Without a big agency and a lot of expertise, how do you grow your business and manage the demands of your day job, all while paying attention to social media, your blog, and more? Learn the concepts and technologies in digital marketing, and leave with a concrete roadmap for putting it to work for your business.",
    "background": "You won't need a big background in marketing, but leading a product or service team, or running a business, will be helpful context for you.",
    "objective_1": "Why digital marketing is important, and how it differs from traditional marketing",
    "objective_2": "What are the tools, technologies, and terms? PPC, SEM, SEO, and so on",
    "objective_3": "How to measure results",
    "objective_4": "Get a road map, scaled for your team and resources, that allows you to tackle digital marketing pragmatically",
    "speaker": "Scott Love (Codence)"
  },
  {
    "track": "General",
    "date": "8/7/2019",
    "time_start": "6:30:00",
    "time_end": "7:15:00",
    "location": "Coquina Lawn",
    "code": "GEN10",
    "name": "Yoga",
    "description": "Start each day at DevCon preparing your body and mind for the day ahead. Vinyasa yoga is a style of yoga where movement is synchronized to the breath. This style is sometimes also called flow yoga, because of the smooth way that the poses run together and become like a dance. The breath acts as an anchor to the movement as you to flow from one pose to the next in time with an inhale or an exhale. Enjoy your me time.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "General",
    "date": "8/6/2019",
    "time_start": "9:00:00",
    "time_end": "10:30:00",
    "location": "Osceola C/D",
    "code": "GEN01",
    "name": "Opening Keynote",
    "description": "DevCon '19 will be unlike any other. New CEO Brad Freitag will deliver his vision for the future of the company and unveil special developments to the platform. Plus, the Platform Evangelism team will provide an inside look at real-life innovations in the workplace.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "General",
    "date": "8/8/2019",
    "time_start": "9:30:00",
    "time_end": "10:30:00",
    "location": "Osceola C/D",
    "code": "GEN06",
    "name": "Fireside Chat",
    "description": "What development questions keep you up at night? Meet a panel of FileMaker product managers and engineers and get answers to your questions about FileMaker features, best practices, and anything else related to the FileMaker Platform.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "General",
    "date": "8/6/2019",
    "time_start": "12:00:00",
    "time_end": "13:30:00",
    "location": "Exhibit Hall E",
    "code": "GEN02",
    "name": "Women of FileMaker Luncheon",
    "description": "Please join us for the annual Women Innovating Together Luncheon to be held during DevCon. The theme of the luncheon this year is “NOW PRESENTING: WITfm”.\u000bThe luncheon is included in your official FileMaker Developer Conference registration. We hope to see all of the women in attendance at DevCon joining us for the luncheon! First-time DevCon attendees are especially welcome, this is great way to meet other attendees.\u000bWe kindly ask that women interested in the luncheon register below by MONDAY, JULY 1, 2019 to help us plan ahead and know who is coming. <a href=\"https://womeninnovatingtogether.org/events/luncheon/luncheon-form/\" target=\"new\">Register now ></a>\u000bThe WITfm luncheon provides an excellent opportunity for women to connect at DevCon. We will have time to catch up with old friends and make new ones! You will also have a chance to celebrate the 2019 DevCon Scholarship winners, learn about the different WITfm initiatives at DevCon and throughout the year and how you can get connected.\u000bWe can’t wait to see you all in Orlando!",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "General",
    "date": "8/5/2019",
    "time_start": "17:00:00",
    "time_end": "19:00:00",
    "location": "Tallahassee 1 - 3",
    "code": "GEN12",
    "name": "CWP User Group",
    "description": "What does CWP even mean these days? Come join us for our 13th annual show-and-tell of Custom Web Publishing techniques, tips, and ideas. This is a friendly, informal opportunity to see demonstrations by fellow CWP developers. All web-related tools and technologies are relevant.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "General",
    "date": "8/6/2019",
    "time_start": "17:30:00",
    "time_end": "18:30:00",
    "location": "Wreckers",
    "code": "GEN14",
    "name": "FileMaker Pub Trivia",
    "description": "Join your peers and the FileMaker team for an interactive FileMaker trivia quiz. Test your knowledge, have fun, and win swag.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "Integrate",
    "date": "8/8/2019",
    "time_start": "11:00:00",
    "time_end": "12:00:00",
    "location": "Osceola A",
    "code": "INT19",
    "name": "FileMaker and Graph Databases",
    "description": "How can Facebook, Amazon, LinkedIn, and Google provide recommendations in near-real time? What database engine is used to investigate the Panama papers? Can we tap into that power with the FileMaker Platform? Sure! Learn more about the power of so called graph databases. We will use the most popular one, Neo4j, as an example and show step-by-step how we can integrate a graph database in a FileMaker solution. The showcased FileMaker apps are free to download after the session.",
    "background": "A good knowledge of FileMaker scripting is required to get the most from this session.",
    "objective_1": "What is a graph database? Why would I care?",
    "objective_2": "Loading FileMaker data into a graph",
    "objective_3": "Dynamically update a graph from FileMaker",
    "objective_4": "Build a FileMaker app based on a graph database",
    "speaker": "Joris Aarts (ClickWorks)"
  },
  {
    "track": "Integrate",
    "date": "8/7/2019",
    "time_start": "11:15:00",
    "time_end": "11:30:00",
    "location": "Osceola 4 - 6",
    "code": "INT14",
    "name": "Connecting to Medical IoT Devices — Lightning Talk",
    "description": "Hey FileMaker — what's my heart rate?\" The medical Internet of Things (IoT) is gaining momentum. Learn how to integrate an IoT device with FileMaker in order to improve patient monitoring in a home healthcare environment.",
    "background": "An advanced level of FileMaker Platform knowledge.",
    "objective_1": "What is IoT",
    "objective_2": "How to integrate a remote IoT medical device with FileMaker",
    "objective_3": "Securing communication between device and FileMaker",
    "objective_4": "Interoperability using APIs to push and pull information",
    "speaker": "Tim Brown (Antidote Solution)"
  },
  {
    "track": "Integrate",
    "date": "8/6/2019",
    "time_start": "11:30:00",
    "time_end": "11:45:00",
    "location": "Osceola 4 - 6",
    "code": "INT03",
    "name": "AI Chatbots — Lightning Talk",
    "description": "Learn about face and object recognition app with an AI chatbot.",
    "background": "An attendee should have a basic understanding of how data can lead to insights.",
    "objective_1": "The difference between classical machine learning, machine learning, and deep learning",
    "objective_2": "How machine learning impacts the client's bottom line and the high-impact use cases across sectors",
    "objective_3": "Some machine learning tools to integrate with FileMaker using pre-trained data or training your own models",
    "objective_4": "Examples in action",
    "speaker": "Luke Rochester, Johan Hedman"
  },
  {
    "track": "Integrate",
    "date": "8/6/2019",
    "time_start": "11:45:00",
    "time_end": "12:00:00",
    "location": "Osceola 4 - 6",
    "code": "INT05",
    "name": "More Machine Learning Examples — Lightning Talk",
    "description": "A few high-level examples of classification with MonkeyLearn machine learning, and clustering with Tableau and Python machine learning.",
    "background": "An attendee should have a basic understanding of how data can lead to insights.",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Heidi Porter (The Moyer Group, Inc.)"
  },
  {
    "track": "Integrate",
    "date": "8/6/2019",
    "time_start": "14:45:00",
    "time_end": "15:45:00",
    "location": "Osceola D",
    "code": "INT20",
    "name": "FileMaker and Peripherals",
    "description": "You can enhance your custom apps created for iOS by using hardware peripherals that fit with FileMaker. Peripherals can add features to your app like: payment processing, bluetooth-based printing, RFID scanning, NFC scanning,1D/2D barcode scanning, encrypted payment capture, AR, and more! \u000bThis session will introduce you to examples of these peripherals and walk you through how your FileMaker app on an iOS device can communicate with peripherals so that you can take advantage of these advanced features. This session will also help you envision how peripherals can take your FileMaker Go apps to the next level.",
    "background": "Experience creating FileMaker apps.",
    "objective_1": "Introduction to peripherals that work with FileMaker Go",
    "objective_2": "How peripherals can enhance your FileMaker Go custom apps",
    "objective_3": "Learn how FileMaker apps and peripherals speak to each other",
    "objective_4": "Be inspired by real-world examples of FileMaker apps working with peripherals",
    "speaker": "Cris Ippolite (iSolutions)"
  },
  {
    "track": "Share",
    "date": "8/6/2019",
    "time_start": "11:00:00",
    "time_end": "12:00:00",
    "location": "Osceola A",
    "code": "SHA01",
    "name": "Mobile Device Management",
    "description": "Mobile device management (MDM) allows you to deploy iOS devices at enterprise scale. There are many provider options; you can roll your own or subscribe to a  managed service like JAMF. How do you choose? And what else do you need to know to successfully roll out an MDM project.",
    "background": "",
    "objective_1": "MDM 101",
    "objective_2": "Key benefits of remote management",
    "objective_3": "FileMaker iOS SDK building and deploying a custom app",
    "objective_4": "Common pitfalls and how to avoid them",
    "speaker": "Guy Halligan (Harvey Water Softeners Ltd.)"
  },
  {
    "track": "Share",
    "date": "8/8/2019",
    "time_start": "11:00:00",
    "time_end": "12:00:00",
    "location": "Osceola D",
    "code": "SHA10",
    "name": "Future FileMaker Cloud",
    "description": "Get an overview of the future FileMaker Cloud. The session will cover purchase, deployment, and setup and present a summary of the architecture and design of the next FileMaker Cloud offering.",
    "background": "No prerequisites.",
    "objective_1": "How to purchase and deploy FileMaker Cloud",
    "objective_2": "How to setup FileMaker Cloud",
    "objective_3": "Overview of FileMaker Customer Console",
    "objective_4": "Overview of architecture and design",
    "speaker": "Sangita Bannerjee, Hering Cheng"
  },
  {
    "track": "Share",
    "date": "8/6/2019",
    "time_start": "13:30:00",
    "time_end": "14:30:00",
    "location": "Osceola D",
    "code": "SHA02",
    "name": "Server Monitoring with Zabbix",
    "description": "The removal of the statistics chart from the admin console has left developers scrambling to come up with alternate ways of monitoring the health of their deployments. The free Zabbix software provides a way to do this and much more. You can track a variety of server metrics for one or multiple servers and configure alerts or other actions to be triggered by certain events; e.g. receive a text if elapsed time per call has been high for longer than a minute. Come to this session to find out what Zabbix can do and how to set it up with your FileMaker solution deployment.",
    "background": "Attendees should have a basic understanding of FileMaker Server.",
    "objective_1": "How to install Zabbix on AWS",
    "objective_2": "How to monitor FileMaker and OS performance metrics",
    "objective_3": "How to set up a dashboard to visualize the data",
    "objective_4": "How to configure triggers to send alerts or take other action",
    "speaker": "Mislav Kos, Wim DeCorte"
  },
  {
    "track": "Share",
    "date": "8/7/2019",
    "time_start": "13:30:00",
    "time_end": "14:30:00",
    "location": "Osceola B",
    "code": "SHA05",
    "name": "Doing it Right: Fast Solutions Developed WAN First",
    "description": "Stop expecting that users will have a server under their desk. Remote workers are the new normal and the responsibility to make their solutions fast and effective falls clearly on our shoulders. Building WAN First means designing a solution from day one with features and an underlying architecture that won't bog down with network latency or bandwidth limitations. Let's look at some new and old recipes for success in this situation.",
    "background": "Attendees who have previously designed and deployed solutions with remote users will stand to gain the most from this session.",
    "objective_1": "Strategies for fast finds and relationships",
    "objective_2": "When to ask \"Why?",
    "objective_3": "Normalize or denormalize? Why you would choose one or the other",
    "objective_4": "How to get outside your bubble, using real world networks and representative data",
    "speaker": "Chris Irvine (Threeprong.com)"
  },
  {
    "track": "Share",
    "date": "8/8/2019",
    "time_start": "14:45:00",
    "time_end": "15:45:00",
    "location": "Osceola B",
    "code": "SHA09",
    "name": "Branding Your Own FileMaker Admin Console",
    "description": "The FileMaker Admin API allows an unparalleled amount of access towards customizing your own admin console interface. Whether you are building a monitoring dashboard for your private server or a light admin duty console for a client, the Admin API gives a standard and easy format for connecting and performing operations from anywhere. This session will show a simple client branded admin console inspire you with  ideas for implementing your own custom admin consoles.",
    "background": "No prerequisites.",
    "objective_1": "How the FileMaker Admin API can be used to create client-specific web apps",
    "objective_2": "Modular deployment of a console to enable or disable services",
    "objective_3": "Discussion on the value-added prospect of the FileMaker Admin API",
    "objective_4": "Making a web app \"Super Admin\" control panel for FileMaker Servers",
    "speaker": "Mike Beargie (MainSpring, Inc.)"
  },
  {
    "track": "Training Day",
    "date": "8/5/2019",
    "time_start": "9:00:00",
    "time_end": "16:30:00",
    "location": "Sanibel 1 - 3",
    "code": "TRA07",
    "name": "FileMaker Data API",
    "description": "Take a deep dive into using the FileMaker Data API. Set your FileMaker Server up as a REST API source for other applications. Learn to use the FileMaker Data API for Custom Web Publishing.",
    "background": "Comfortable with FileMaker layouts, scripting, and the relationships graph. Familiarity with the FileMaker Server Admin Console. \u000bOptional: Some experience with Postman and the Insert From URL script step. Some experience building web applications with either PHP or Node.js.",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Steve Winter (Matatiro Solutions)"
  },
  {
    "track": "Training Day",
    "date": "8/5/2019",
    "time_start": "9:00:00",
    "time_end": "12:00:00",
    "location": "Osceola 4 - 6",
    "code": "TRA03",
    "name": "Intermediate — Layouts",
    "description": "FileMaker layouts are more than just the representation of your user interface. Layouts are used for your user interface, for output such as PDFs, for printing, and more. This session aims to provide you with a richer understanding of how layouts factor into the whole of your custom app. Learn about the various tools you can use in Layout mode, as well as the possible options available when it comes to designing and using layouts in your custom apps.",
    "background": "Familiar with the concept of the relationships graph and a layout. Added and used most of the possible layout parts in a variety of layouts. Used the fields pane. Comfortable with using the Manage Layouts dialog box. Familiar with the various field widget types. Used the objects pane.",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Matt Petrowsky (ISO Productions, Inc.)"
  },
  {
    "track": "Training Day",
    "date": "8/5/2019",
    "time_start": "9:00:00",
    "time_end": "16:30:00",
    "location": "Osceola B",
    "code": "TRA06",
    "name": "FileMaker Training for Advanced Developers",
    "description": "Learn advanced techniques and strategies for creating high-performing, scalable FileMaker custom apps. Explore tools and techniques to make you a more efficient and confident developer. This session includes a combination of demonstrations and hands-on exercises. Topics include: Perform Script on Server, ExecuteSQL, virtual lists, Insert From URL, custom functions, Script Triggers, JSON, advanced scripting, calculations, and layout techniques. Demo files and resources will be available so you can continue to practice and learn on your own after class.",
    "background": "At least three years of FileMaker development experience. Comfortable with themes, loops, subsummary fields and parts, script variables, aggregate functions, and relationships.",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Bob Bowers (Soliant Consulting, Inc.)"
  },
  {
    "track": "Training Day",
    "date": "8/5/2019",
    "time_start": "9:00:00",
    "time_end": "16:30:00",
    "location": "Osceola 1 - 3",
    "code": "TRA08",
    "name": "JavaScript for FileMaker Developers",
    "description": "JavaScript is natively supported in all parts of the FileMaker Platform. The first part of this course is focused on scope, variables, and functions, connecting those concepts to your existing FileMaker skills. You’ll also learn how to integrate JavaScript libraries into custom apps, how to set up the library inside of a FileMaker file, how to call FileMaker scripts with JavaScript, and how to call JavaScript with FileMaker scripts. In addition, you’ll learn tips for working with the web viewer and JavaScript in your custom apps.\u000bThe day will be packed. We'll explore a lot, and have a good time.",
    "background": "You don’t need to know any JavaScript, so come only with your FileMaker skills.",
    "objective_1": "The basics of the JavaScript language",
    "objective_2": "The peculiarities of the web viewer object on different operating systems",
    "objective_3": "How to integrate full JavaScript libraries into your custom app",
    "objective_4": "How to communicate back and forth between FileMaker and JavaScript without refreshing the web viewer",
    "speaker": "Jeremy Brown (Geist Interactive)"
  },
  {
    "track": "Vendor Session",
    "date": "8/7/2019",
    "time_start": "11:00:00",
    "time_end": "11:30:00",
    "location": "Sun Ballroom",
    "code": "VEN12",
    "name": "FileMaker Integration: Roadmap for the future, part 2 by LuminFire",
    "description": "Explore the latest techniques in the adventurous world of integration. Get FileMaker to talk to the world out there without complex plugins, JSON, cURL, or APIs in a secure and stable way. See real life stories of connecting FileMaker to inspire you. Examples include WordPress, PDFs, Twilio, Slack, AWS S3, Stripe, MailGun, MailChimp, Hubspot, and many more. Learn about brilliant solutions like fmIgnite, fmFlare, BrilliantSync and BrilliantGateway that can take your business to new heights. The right solution partner can make all the difference.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Tim Cimbura (LuminFire)"
  },
  {
    "track": "Vendor Session",
    "date": "8/8/2019",
    "time_start": "11:00:00",
    "time_end": "11:30:00",
    "location": "Sun Ballroom",
    "code": "VEN05",
    "name": "Leveraging the Edge: FileMaker integration and beyond!",
    "description": "FileMaker is a great custom app development tool, but its evolving capability to integrate with other systems makes it an unparalleled Workplace Innovation Platform. With the ability to integrate through its support for various industry standards (XML, JDBC/ODBC, PHP, REST API, JSON), FileMaker is a great platform to integrate with almost anything. Presented by James Hea, project manager at Direct Impact Solutions, this session will demonstrate some of our most recent API integration examples including Office 365 cloud-based services and Cyberimpact, a Canadian Anti-Spam Law (CASL) compliant mass e-mailing tool.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "James Hea (Direct Impact)"
  },
  {
    "track": "Vendor Session",
    "date": "8/8/2019",
    "time_start": "12:45:00",
    "time_end": "13:15:00",
    "location": "Sun Ballroom",
    "code": "VEN09",
    "name": "Say What!?",
    "description": "Since the beginning of time the ability to  communicate effectively has been one of the most vital necessities and cherished skills in both, personal and professional development. Whether you are an introvert, extrovert, in-house or consulting professional, every single one of us communicates with someone at some point in the day. We are all on a life long journey to improve this vital skill. Brandon Hayes, Founder of Kalos Consulting and Anthony Coltman, Sr. Consultant will shed light on some of the common challenges individuals face when it comes to effectively communicating.\u000bIn this session you will learn how to:\u000b • Effectively share a thought or idea with internal team members.\u000b • Disarm tense situations with effective conflict management.\u000b• Effectively engage by asking strategic questions and demonstrating increased listening.\u000b• Use DISC profiling to make better business decisions and build strong internal/external rapport.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Brandon Hayes (Kalos Consulting Inc.)"
  },
  {
    "track": "Vendor Session",
    "date": "8/7/2019",
    "time_start": "13:30:00",
    "time_end": "14:00:00",
    "location": "Sun Ballroom",
    "code": "VEN18",
    "name": "Core CRM Pro: The perfect combination of features and functionality by Productive Computing",
    "description": "Join Stuart Hite, Productive Computing instructor and certified developer, as he demonstrates the new Core CRM Pro, a true Workplace Innovation Platform solution for contact management. Learn the best methods to efficiently and productively control detailed interactions with contacts, estimates, invoices, dashboards, tasks, notes, calls, calendars, and full integration with QuickBooks Desktop and QuickBooks Online.  At the core of every successful business is a seamless solution for managing your relationship with customers.  Come and see how the new Core CRM Pro fulfills that fundamental need for you and your clients.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Stuart Hite (Productive Computing)"
  },
  {
    "track": "Vendor Session",
    "date": "8/7/2019",
    "time_start": "14:15:00",
    "time_end": "14:45:00",
    "location": "Sun Ballroom",
    "code": "VEN17",
    "name": "LCFM Native: Deploy FileMaker to native apps",
    "description": "LCFM Native allows you to deploy your FileMaker custom apps as a native app on any platform, including Android, iOS, Windows, Mac, and Linux. You can keep your data within FileMaker and use our drag and drop tool to compile your solution as a fully native app on an Android device, or indeed any other. No additional coding required. This is the first and only tool in the FileMaker space that allows you to do this. Kevin Miller, CEO of LiveCode will demonstrate how you can drag and drop your FM layouts into LCFM Native, and compile them to run natively on Android, iOS, Mac, Windows, or Linux.\u000b • Deploy a FileMaker solution as a native app on Android\u000b • Cross platform, includes Android, iOS, Mac, Windows and Linux\u000b • Enjoy full access to the OS within your FileMaker applications\u000b • Keep your data in FileMaker Server or Cloud\u000b • Drag and drop tool, no coding required",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Kevin Miller (LiveCode)"
  }
],
"comments": [
		{
    "id": 1,
    "text": "This thing is amazing.",
    "rating": 4,
    "date_created": "2019-10-31 23:14:12.649275",
    "id_session": 1,
    "id_user": 1
  },
  {
    "id": 2,
    "text": "Put a bird on it!",
    "rating": 4,
    "date_created": "2019-10-31 23:14:12.649275",
    "id_session": 1,
    "id_user": 1
  },
  {
    "id": 3,
    "text": "All the other reviewers are obviously insane, but this thing is actually pretty amazing.",
    "rating": 5,
    "date_created": "2019-10-31 23:14:12.649275",
    "id_session": 1,
    "id_user": 2
  },
  {
    "id": 4,
    "text": "When life gives you lemons, trade them for this thing.",
    "rating": 4,
    "date_created": "2019-10-31 23:14:12.649275",
    "id_session": 1,
    "id_user": 2
  }
	],
"users" : [
  {
    "id": 1,
    "user_name": "dunder",
    "password": "$2a$12$ijvWD84EtJhC8AKFjT1cB.Bcm7T28M7/9pPs6E03Yl8z5rcd6Ld5.",
    "full_name": "Dunder Mifflin",
    "date_created": "2019-10-31 23:14:12.649275",
    "date_modified": ""
  },
  {
    "id": 2,
    "user_name": "demo",
    "password": "$2a$12$ijvWD84EtJhC8AKFjT1cB.Bcm7T28M7/9pPs6E03Yl8z5rcd6Ld5.",
    "full_name": "Demo User2",
    "date_created": "2019-10-31 23:14:12.649275",
    "date_modified": ""
  }
]
}