{
"sessions" : [
  {
    "track": "Business",
    "date": "8/6/2019",
    "time_start": "14:00:00",
    "time_end": "14:30:00",
    "location": "Osceola 4 - 6",
    "code": "BUS03",
    "name": "FileMaker in Action — 5 Steps to Bring a Legacy App Up to Speed",
    "description": "Business was thriving using a custom tailored FileMaker application developed bit by bit over the past 20 years, but could it improve even more by modernizing our technology? In this session, I will share the 5 steps used to migrate my legacy application to current FileMaker in 2018. Changing horse in the middle of the stream is hard. When it was done, I was happy to retire my tired legacy application and ride off with a new shiny one. Business jumped 20%.",
    "background": "",
    "objective_1": "How to migrate legacy applications to current FileMaker technology",
    "objective_2": "The details on the 5 steps involved for success",
    "objective_3": "What type of results we saw by making the move",
    "objective_4": "",
    "speaker": "Roger Benedict (Ruggs Benedict)"
  },
  {
    "track": "Business",
    "date": "8/6/2019",
    "time_start": "14:45:00",
    "time_end": "15:15:00",
    "location": "Osceola 1 - 3",
    "code": "BUS04",
    "name": "FileMaker in Action — Custom Apps for Manufacturing and Warehouses",
    "description": "In this session, we'll cover topics that relate well to the manufacturing/warehouse space. First, two approaches to inventory; one easy-to-implement solution with unstored calcs, and a more complex solution using static fields with scripted amount updates. Next, we'll go over the creation of labels for the warehouse and how we've used automation to save a LOT of time, including taking a 60 or 90 minute process per shipment down to 30 to 60 seconds. Optionally, as time permits in the session, we will cover some of the practicalities of using FileMaker in a warehouse space.",
    "background": "Attendees should have a basic understanding of one to many relationships, calculation fields, and global fields.",
    "objective_1": "An easy approach to inventory using calculation fields",
    "objective_2": "A more complex approach to inventory using script updates to static fields",
    "objective_3": "Label creation within FileMaker to save a lot of time (looping is key)",
    "objective_4": "Practicalities of FileMaker in a warehouse space",
    "speaker": "Bradley Boggs (Chameleon Like, Inc.)"
  },
  {
    "track": "Create",
    "date": "8/7/2019",
    "time_start": "14:45:00",
    "time_end": "15:45:00",
    "location": "Osceola B",
    "code": "CRE10",
    "name": "From Clutter to Clarity: Redesigning Layouts for Improved User Experience",
    "description": "Are your interfaces easy to interpret and intuitive to use, or are they so complex that they require explanation and special training? In this session, I'll take a series of cluttered real-world legacy layouts and show in time-lapse fashion how I would redesign them for an improved user experience. I’ll discuss design principles and patterns. I’ll also demonstrate FileMaker-specific skills such as working with styles and themes. I'll also show the same layouts as re-envisioned by several other designers within the FileMaker Community.",
    "background": "You should be comfortable creating and modifying layouts.",
    "objective_1": "Concrete examples of design principles and patterns",
    "objective_2": "Working with styles and themes",
    "objective_3": "Indicating interactivity in clear and consistent ways",
    "objective_4": "Customizing icons",
    "speaker": "Mark Baum (Soliant Consulting)"
  },
  {
    "track": "Create",
    "date": "8/7/2019",
    "time_start": "16:15:00",
    "time_end": "17:15:00",
    "location": "Osceola D",
    "code": "CRE12",
    "name": "Intent-Driven Design: Storytelling Through Visual Narratives",
    "description": "Have you heard about storytelling in UX and how it improves usability and engagement? User intent is a starting point of a successful dialogue, and clear communication doesn't always have to be verbal. It must be concise and accessible. In this session, we will elaborate on the essence of good design: simplicity and familiarity. You will learn how to take these simple principles to demonstrate examples of visual narratives that reflect users' intent. We will be visiting a variety of user scenarios, visual elements, and interface building blocks, and learn how to sequence them to create workflows with a clear purpose and a sense of progress.",
    "background": "No prerequisites.",
    "objective_1": "How to improve usability and engagement through visual storytelling",
    "objective_2": "What makes up good design",
    "objective_3": "How to take simple principles to demonstrate examples of visual narratives that reflect users intent",
    "objective_4": "How to create sequences and workflows to demonstrate purpose and a sense of progress",
    "speaker": "Chih Hsiao, Esther Kim"
  },
  {
    "track": "FBA",
    "date": "8/7/2019",
    "time_start": "11:00:00",
    "time_end": "12:00:00",
    "location": "Osceola 1 - 3",
    "code": "FBA03",
    "name": "FBA Partner Council Panel Discussion (FBA Members Only)",
    "description": "The FBA Partner Council (FPC) is a collaboration between FileMaker and a global representation of 9 FBA partners. The purpose of the FPC is to:\u000bShare ideas and plans for mutual growth\u000bFoster collaboration to ensure a thriving FileMaker ecosystem \u000bImprove communication between FileMaker and FBA community\u000bDuring this facilitated session, we will break out into small groups to invite open discussion with session attendees to discuss and consolidate ideas",
    "background": "Current FBA membership is required to attend this session.",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "FBA",
    "date": "8/7/2019",
    "time_start": "14:45:00",
    "time_end": "15:45:00",
    "location": "Osceola 1 - 3",
    "code": "FBA04",
    "name": "DIY Digital Marketing",
    "description": "Gartner Research predicted that by 2017 CMOs would spend more than CIOs on technology. We're well past that transition and see increasing responsibility for marketers. Today, it's all about customer experience; the lines are totally blurred between new and existing customers. Without a big agency and a lot of expertise, how do you grow your business and manage the demands of your day job, all while paying attention to social media, your blog, and more? Learn the concepts and technologies in digital marketing, and leave with a concrete roadmap for putting it to work for your business.",
    "background": "You won't need a big background in marketing, but leading a product or service team, or running a business, will be helpful context for you.",
    "objective_1": "Why digital marketing is important, and how it differs from traditional marketing",
    "objective_2": "What are the tools, technologies, and terms? PPC, SEM, SEO, and so on",
    "objective_3": "How to measure results",
    "objective_4": "Get a road map, scaled for your team and resources, that allows you to tackle digital marketing pragmatically",
    "speaker": "Scott Love (Codence)"
  },
  {
    "track": "General",
    "date": "8/5/2019",
    "time_start": "17:00:00",
    "time_end": "19:00:00",
    "location": "Tallahassee 1 - 3",
    "code": "GEN12",
    "name": "CWP User Group",
    "description": "What does CWP even mean these days? Come join us for our 13th annual show-and-tell of Custom Web Publishing techniques, tips, and ideas. This is a friendly, informal opportunity to see demonstrations by fellow CWP developers. All web-related tools and technologies are relevant.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "General",
    "date": "8/6/2019",
    "time_start": "17:30:00",
    "time_end": "18:30:00",
    "location": "Wreckers",
    "code": "GEN14",
    "name": "FileMaker Pub Trivia",
    "description": "Join your peers and the FileMaker team for an interactive FileMaker trivia quiz. Test your knowledge, have fun, and win swag.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "FileMaker Staff"
  },
  {
    "track": "Integrate",
    "date": "8/6/2019",
    "time_start": "11:45:00",
    "time_end": "12:00:00",
    "location": "Osceola 4 - 6",
    "code": "INT05",
    "name": "More Machine Learning Examples — Lightning Talk",
    "description": "A few high-level examples of classification with MonkeyLearn machine learning, and clustering with Tableau and Python machine learning.",
    "background": "An attendee should have a basic understanding of how data can lead to insights.",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Heidi Porter (The Moyer Group, Inc.)"
  },
  {
    "track": "Integrate",
    "date": "8/6/2019",
    "time_start": "14:45:00",
    "time_end": "15:45:00",
    "location": "Osceola D",
    "code": "INT20",
    "name": "FileMaker and Peripherals",
    "description": "You can enhance your custom apps created for iOS by using hardware peripherals that fit with FileMaker. Peripherals can add features to your app like: payment processing, bluetooth-based printing, RFID scanning, NFC scanning,1D/2D barcode scanning, encrypted payment capture, AR, and more! \u000bThis session will introduce you to examples of these peripherals and walk you through how your FileMaker app on an iOS device can communicate with peripherals so that you can take advantage of these advanced features. This session will also help you envision how peripherals can take your FileMaker Go apps to the next level.",
    "background": "Experience creating FileMaker apps.",
    "objective_1": "Introduction to peripherals that work with FileMaker Go",
    "objective_2": "How peripherals can enhance your FileMaker Go custom apps",
    "objective_3": "Learn how FileMaker apps and peripherals speak to each other",
    "objective_4": "Be inspired by real-world examples of FileMaker apps working with peripherals",
    "speaker": "Cris Ippolite (iSolutions)"
  },
  {
    "track": "Share",
    "date": "8/7/2019",
    "time_start": "13:30:00",
    "time_end": "14:30:00",
    "location": "Osceola B",
    "code": "SHA05",
    "name": "Doing it Right: Fast Solutions Developed WAN First",
    "description": "Stop expecting that users will have a server under their desk. Remote workers are the new normal and the responsibility to make their solutions fast and effective falls clearly on our shoulders. Building WAN First means designing a solution from day one with features and an underlying architecture that won't bog down with network latency or bandwidth limitations. Let's look at some new and old recipes for success in this situation.",
    "background": "Attendees who have previously designed and deployed solutions with remote users will stand to gain the most from this session.",
    "objective_1": "Strategies for fast finds and relationships",
    "objective_2": "When to ask \"Why?",
    "objective_3": "Normalize or denormalize? Why you would choose one or the other",
    "objective_4": "How to get outside your bubble, using real world networks and representative data",
    "speaker": "Chris Irvine (Threeprong.com)"
  },
  {
    "track": "Share",
    "date": "8/8/2019",
    "time_start": "14:45:00",
    "time_end": "15:45:00",
    "location": "Osceola B",
    "code": "SHA09",
    "name": "Branding Your Own FileMaker Admin Console",
    "description": "The FileMaker Admin API allows an unparalleled amount of access towards customizing your own admin console interface. Whether you are building a monitoring dashboard for your private server or a light admin duty console for a client, the Admin API gives a standard and easy format for connecting and performing operations from anywhere. This session will show a simple client branded admin console inspire you with  ideas for implementing your own custom admin consoles.",
    "background": "No prerequisites.",
    "objective_1": "How the FileMaker Admin API can be used to create client-specific web apps",
    "objective_2": "Modular deployment of a console to enable or disable services",
    "objective_3": "Discussion on the value-added prospect of the FileMaker Admin API",
    "objective_4": "Making a web app \"Super Admin\" control panel for FileMaker Servers",
    "speaker": "Mike Beargie (MainSpring, Inc.)"
  },
  {
    "track": "Training Day",
    "date": "8/5/2019",
    "time_start": "9:00:00",
    "time_end": "16:30:00",
    "location": "Osceola B",
    "code": "TRA06",
    "name": "FileMaker Training for Advanced Developers",
    "description": "Learn advanced techniques and strategies for creating high-performing, scalable FileMaker custom apps. Explore tools and techniques to make you a more efficient and confident developer. This session includes a combination of demonstrations and hands-on exercises. Topics include: Perform Script on Server, ExecuteSQL, virtual lists, Insert From URL, custom functions, Script Triggers, JSON, advanced scripting, calculations, and layout techniques. Demo files and resources will be available so you can continue to practice and learn on your own after class.",
    "background": "At least three years of FileMaker development experience. Comfortable with themes, loops, subsummary fields and parts, script variables, aggregate functions, and relationships.",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Bob Bowers (Soliant Consulting, Inc.)"
  },
  {
    "track": "Training Day",
    "date": "8/5/2019",
    "time_start": "9:00:00",
    "time_end": "16:30:00",
    "location": "Osceola 1 - 3",
    "code": "TRA08",
    "name": "JavaScript for FileMaker Developers",
    "description": "JavaScript is natively supported in all parts of the FileMaker Platform. The first part of this course is focused on scope, variables, and functions, connecting those concepts to your existing FileMaker skills. You’ll also learn how to integrate JavaScript libraries into custom apps, how to set up the library inside of a FileMaker file, how to call FileMaker scripts with JavaScript, and how to call JavaScript with FileMaker scripts. In addition, you’ll learn tips for working with the web viewer and JavaScript in your custom apps.\u000bThe day will be packed. We'll explore a lot, and have a good time.",
    "background": "You don’t need to know any JavaScript, so come only with your FileMaker skills.",
    "objective_1": "The basics of the JavaScript language",
    "objective_2": "The peculiarities of the web viewer object on different operating systems",
    "objective_3": "How to integrate full JavaScript libraries into your custom app",
    "objective_4": "How to communicate back and forth between FileMaker and JavaScript without refreshing the web viewer",
    "speaker": "Jeremy Brown (Geist Interactive)"
  },
  {
    "track": "Vendor Session",
    "date": "8/8/2019",
    "time_start": "12:45:00",
    "time_end": "13:15:00",
    "location": "Sun Ballroom",
    "code": "VEN09",
    "name": "Say What!?",
    "description": "Since the beginning of time the ability to  communicate effectively has been one of the most vital necessities and cherished skills in both, personal and professional development. Whether you are an introvert, extrovert, in-house or consulting professional, every single one of us communicates with someone at some point in the day. We are all on a life long journey to improve this vital skill. Brandon Hayes, Founder of Kalos Consulting and Anthony Coltman, Sr. Consultant will shed light on some of the common challenges individuals face when it comes to effectively communicating.\u000bIn this session you will learn how to:\u000b • Effectively share a thought or idea with internal team members.\u000b • Disarm tense situations with effective conflict management.\u000b• Effectively engage by asking strategic questions and demonstrating increased listening.\u000b• Use DISC profiling to make better business decisions and build strong internal/external rapport.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Brandon Hayes (Kalos Consulting Inc.)"
  },
  {
    "track": "Vendor Session",
    "date": "8/7/2019",
    "time_start": "13:30:00",
    "time_end": "14:00:00",
    "location": "Sun Ballroom",
    "code": "VEN18",
    "name": "Core CRM Pro: The perfect combination of features and functionality by Productive Computing",
    "description": "Join Stuart Hite, Productive Computing instructor and certified developer, as he demonstrates the new Core CRM Pro, a true Workplace Innovation Platform solution for contact management. Learn the best methods to efficiently and productively control detailed interactions with contacts, estimates, invoices, dashboards, tasks, notes, calls, calendars, and full integration with QuickBooks Desktop and QuickBooks Online.  At the core of every successful business is a seamless solution for managing your relationship with customers.  Come and see how the new Core CRM Pro fulfills that fundamental need for you and your clients.",
    "background": "",
    "objective_1": "",
    "objective_2": "",
    "objective_3": "",
    "objective_4": "",
    "speaker": "Stuart Hite (Productive Computing)"
  },
],
"comments": [
		{
    "id": 1,
    "text": "This thing is amazing.",
    "rating": 4,
    "date_created": "2019-10-31 23:14:12.649275",
    "id_session": 1,
    "id_user": 1
  },
  {
    "id": 2,
    "text": "Put a bird on it!",
    "rating": 4,
    "date_created": "2019-10-31 23:14:12.649275",
    "id_session": 1,
    "id_user": 1
  },
  {
    "id": 3,
    "text": "All the other reviewers are obviously insane, but this thing is actually pretty amazing.",
    "rating": 5,
    "date_created": "2019-10-31 23:14:12.649275",
    "id_session": 1,
    "id_user": 2
  },
  {
    "id": 4,
    "text": "When life gives you lemons, trade them for this thing.",
    "rating": 4,
    "date_created": "2019-10-31 23:14:12.649275",
    "id_session": 1,
    "id_user": 2
  }
	],
"users" : [
  {
    "id": 1,
    "user_name": "dunder",
    "password": "$2a$12$ijvWD84EtJhC8AKFjT1cB.Bcm7T28M7/9pPs6E03Yl8z5rcd6Ld5.",
    "full_name": "Dunder Mifflin",
    "date_created": "2019-10-31 23:14:12.649275",
    "date_modified": ""
  },
  {
    "id": 2,
    "user_name": "demo",
    "password": "$2a$12$ijvWD84EtJhC8AKFjT1cB.Bcm7T28M7/9pPs6E03Yl8z5rcd6Ld5.",
    "full_name": "Demo User2",
    "date_created": "2019-10-31 23:14:12.649275",
    "date_modified": ""
  }
]
}